#iOS第一章

*1.2
  *GoFのデザインパターンの代表例
  
  **singleton**
  '''swift:例
  let foo = Hoge.shared
  '''
  上の例など、.sharedはシングルトンのパターン（Hogeクラスを参照するためのfoo)
  シングルトンとは？？
  >インスタンスが一つしか生成されないことが保証されているクラス
  使用する理由
  >使用頻度が多い場合インスタンス化によるメモリの消費を防ぐため
  [シングルトン](https://www.bouzuyahonpo.com/swift-singleton/)
  
  **observer**
  オブザーバーとは？？
  >オブジェクトの状態が変化した際に、そのオブジェクト自身が、「観察者」に状態の変化を「通知」する仕組み
  使用する理由
  >実務においては、ViewControllerにAPI通信やデータ取得/更新などのロジックを詰め込むとViewControllerが肥大化してしまい、保守性が低下します。
   そこで例えば、API通信やデータ取得/更新をViewModelに追い出す「MVVMアーキテクチャー」などを導入したりします。
   ViewModelからViewControllerに状態変化の通知をする際にObserverパターンを良く使います。
  [オブザーバー](https://qiita.com/y-some/items/f0dc21619111697cb5bc)
  
  **Mediator**
  >オブジェクト同士のメッセージのやりとりの際に各オブジェクトが自由にメッセージをやりとりするのではなく、共通の調停者を通してメッセージのやり取りを行うパターン
  使用する理由
  >オブジェクト間の結合度を低くする
  [メディエイター](https://qiita.com/y-some/items/c63746780cc56714ff11)
  
  疑問点：　保守性の向上ってなに？？
  
 *1.4
  *アーキテクチャ
  本での定義：　「アプリの大まかなレイヤー分割の捉え方」
  
  そもそも
  レイヤーとは？
  >Veiwに描画する内容を管理するモデルオブジェクト
  viewcontrollerが増えた時、UIの変更が頻繁に起こるときのために作成
  
  アーキテクチャを考えずに開発するデメリット
    *クラスが肥大化し、コードを追いにくくなる
    *ロジックの煩雑化、再利用性の低下
    *ロジックの煩雑化、再利用性の低下
    *チーム開発における役割分担がしにくい
    *属人化が進み、引き継ぎにくい
    *テストがしにくい
    *機能の追加、改修が困難
  
  →継続的なアプリ開発・運用の場合、アーキテクチャを採用した方が良い
  
  
  
